Repository: ulm-university-news/UlmUniversityNewsWindowsApp
Catalog: UlmUniversityNews/UlmUniversityNews/Strings/*/Resources.resw
Source language: en_gb
Languages: de_de

# ApplicationErrorBadRequestError
source: The request was rejected from the server and marked as invalid.
de_de: Der Request wurde vom Server als ungültig abgelehnt.

# ErrorDialogBoxTitle
source: Error
de_de: Fehler

# ApplicationErrorLocalDatabaseError
source: An error occurred during an operation on the local database.
de_de: Es ist ein Fehler bei einer Operation auf der lokalen Datenbank aufgetreten.

# doNotShowAgainCheckBoxText
source: Don't show this again
de_de: Nicht mehr anzeigen

# lockScreenAccessDeniedContentDialogText
source: The application does not have the permission to run background tasks. Please be aware that the delivery of content updates via push notifications does not work without background tasks. The content thus needs to be updated manually. You can grant the permission for background tasks in settings-battery saver-usage.
de_de: Es ist der Anwendung aktuell nicht erlaubt Hintergrundaufgaben auszuführen. Bitte beachten Sie, dass die Aktualisierungen von Inhalten per Push Nachrichten somit nicht funktioniert. Der Inhalt muss manuell aktualisiert werden. Sie können der Anwendung die Ausführung von Hintergrundaufgaben erlauben unter Einstellungen-Stromsparmodus-Nutzung.

# lockScreenAccessDeniedContentDialogTitle
source: Background Tasks
de_de: Hintergrundaufgaben

# ApplicationErrorMethodNotAllowedError
source: The request was rejected from the server due to a wrong HTTP-method.
de_de: Der Server hat den Request abgelehnt aufgrund einer falschen HTTP Methode.

# ApplicationErrorNotFoundError
source: The server could not be reached. The server is probably offline at the moment.
de_de: Der Server konnte nicht erreicht werden. Der Server ist wahrscheinlich aktuell offline.

# ApplicationErrorServerUnreachableError
source: The server could not be reached. Please make sure that your device is connected to the internet.
de_de: Der Server konnte nicht erreicht werden. Bitte stellen Sie sicher, dass eine Internetverbindung besteht.

# ApplicationErrorUnsupportedMediaTypeError
source: The request was rejected due to a wrong media type.
de_de: Der Request wurde abgelehnt aufgrund einer falschen Angabe beim Media Type.

# ApplicationErrorUserDataIncompleteError
source: Some required user data is missing.
de_de: Es wurden nicht alle erforderlichen Nutzerdaten angegeben.

# ApplicationErrorUserForbiddenError
source: You do no have the required permissions for this operation.
de_de: Sie haben nicht die erforderlichen Rechte für diese Aktion.

# ApplicationErrorUserNameInvalidError
source: The specified user name is invalid.
de_de: Der von Ihnen angegebene Nutzername ist nicht gültig.

# ValidationErrorStartPageUserNameLengthInvalid
source: The username must contain at least 3 characters and must not contain more than 35 characters.
de_de: Der Nutzername muss mindestens 3 Zeichen und darf maximal 35 Zeichen umfassen.

# ValidationErrorStartPageUserNameTextInvalid
source: Please don't use any special characters or whitespaces.
de_de: Bitte verwenden Sie für den Nutzernamen keine Leerzeichen und Sonderzeichen.

# ApplicationErrorUserNotFoundError
source: The specified user could not be found.
de_de: Der angegebene Nutzer konnte nicht gefunden werden.

# ApplicationErrorUserPushTokenInvalidError
source: A valid push token needs to be provided to the server.
de_de: Es wurde kein gültiges Push-Token an den Server übermittelt.

# ApplicationErrorWnsChannelInitializationFailed
source: The initialization of the push notification service has failed. Please make sure that your device is connected to the internet.
de_de: Die Initialisierung des Push Nachrichten Dienstes ist fehlgeschlagen. Bitte stellen Sie sicher, dass eine Internetverbindung besteht.

# StartPageCreateAccountButton.Label
source: create account
de_de: erstelle account

# StartPageUsernameDescription.Text
source: To use this app you need to create an user account. To do that you just have to enter a user name below and accept the terms of user. You can find them on
de_de: Um diese App benutzen zu könnnen, müssen Sie ein Nutzerkonto anlegen. Dazu müssen Sie unten einen Nutzername angeben und die Nutzungsbedingungen akzeptieren. Diese können Sie unter folgendem Link abrufen:

# StartPageUsernameTextBox.Header
source: Username
de_de: Nutzername

# StartPageWelcomeText.Text
source: Welcome to University News.
de_de: Willkommen bei University News.

# HomescreenSearchChannelsButton.Label
source: search channel
de_de: suche kanal

# ListItemChannelTypeEventString
source: Event
de_de: Veranstaltung

# ListItemChannelTypeLectureString
source: Lecture
de_de: Vorlesung

# ListItemChannelTypeOtherString
source: Other
de_de: Anderes

# ListItemChannelTypeSportsString
source: Sports group
de_de: Sportgruppe

# ListItemChannelTypeStudentGroupString
source: Student group
de_de: Studentengruppe

# HomescreenAddGroupButton.Label
source: add group
de_de: gruppe hinzufügen

# HomescreenSearchGroupsButton.Label
source: search groups
de_de: suche gruppen

# HomescreenMyChannelsPivotItem.Header
source: My channels
de_de: Meine Kanäle

# HomescreenMyGroupsPivotItem.Header
source: My groups
de_de: Meine Gruppen

# ChannelDetailsChannelInformationPivotItem.Header
source: Channel information
de_de: Kanalinformationen

# ChannelDetailsMessagesPivotItem.Header
source: Announcements
de_de: Benachrichtigungen

# ChannelSearchPageTitle.Text
source: Search channels
de_de: Kanalsuche

# ListItemFacultyEngineeringAndComputerScienceString
source: Faculty of Engineering, Computer Science and Psychology
de_de: Fakultät für Ingenierwissenschaften, Informatik und Psychologie

# ListItemFacultyMathematicsAndEconomicsString
source: Faculty of Mathematics and Economics
de_de: Fakultät für Mathematik und Wirtschaftswissenschaften

# ListItemFacultyMedicinesString
source: Faculty of Medicine
de_de: Medizinische Fakultät

# ListItemFacultyNaturalSciencesString
source: Faculty of Mathematics and Economics
de_de: Fakultät für Naturwissenschaften

# ChannelDetailsChannelContactsField.Text
source: Contact
de_de: Kontaktinformationen

# ChannelDetailsChannelCreationDateField.Text
source: Creation date
de_de: Erstellungsdatum

# ChannelDetailsChannelDatesField.Text
source: Dates
de_de: Termine

# ChannelDetailsChannelDescriptionField.Text
source: Description
de_de: Beschreibung

# ChannelDetailsChannelLocationsField.Text
source: Locations
de_de: Orte

# ChannelDetailsChannelModificationDateField.Text
source: Modification date
de_de: Änderungsdatum

# ChannelDetailsChannelTermField.Text
source: Term
de_de: Semester

# ChannelDetailsChannelTypeField.Text
source: Type
de_de: Kanaltyp

# ChannelDetailsChannelWebsiteField.Text
source: Website
de_de: Webseite

# ChannelDetailsEventCostField.Text
source: Cost
de_de: Eintritt

# ChannelDetailsEventOrganizerField.Text
source: Organizer
de_de: Veranstalter

# ChannelDetailsLectureAssistantField.Text
source: Assistants
de_de: Übungsleiter/Assistenten

# ChannelDetailsLectureEndDateField.Text
source: End date of lecture
de_de: Vorlesungsende

# ChannelDetailsLectureFacultyField.Text
source: Faculty
de_de: Fakultät

# ChannelDetailsLectureLecturerField.Text
source: Lecturer
de_de: Dozent

# ChannelDetailsLectureStartDateField.Text
source: Start date of lecture
de_de: Vorlesungsbeginn

# ChannelDetailsSportCostField.Text
source: Cost
de_de: Kosten

# ChannelDetailsSportNumberOfParticipantsField.Text
source: Number of participants
de_de: Teilnehmerzahl

# ChannelSearchOrderByChannelTypeButton.Label
source: order by type
de_de: ordne nach typ

# ChannelDetailsSubscribeChannelButton.Label
source: subscribe channel
de_de: abonniere kanal

# ChannelDetailsUnsubscribeChannelButton.Label
source: unsub-scribe
de_de: deabonnie-re kanal

# ChannelDetailsNoMessagesInChannelInfo.Text
source: This channel doesn't contain any messages.
de_de: Dieser Kanal enthält noch keine Nachrichten.

# ChannelDetailsUnsubscribeChannelFlyoutButton.Content
source: Unsubscribe
de_de: Deabonnieren

# ChannelDetailsUnsubscribeChannelWarning.Text
source: Do you really want to unsubscribe from this channel?
de_de: Wollen Sie diesen Kanal wirklich deabonnieren?

# ChannelDetailsUpdateAnnouncementsButton.Label
source: update messages
de_de: aktualisiere nachrichten

# DrawerMenuEntryApplicationSettings
source: Application settings
de_de: Anwendungs-einstellungen

# ApplicationSettingsChangeUsernameDescription.Text
source: You can change your username here.
de_de: Sie können Ihren Nutzernamen hier ändern.

# ApplicationSettingsCurrentUsername.Text
source: Your current username is:
de_de: Ihr aktueller Nutzername ist:

# ApplicationSettingsHeaderLanguage.Text
source: Language
de_de: Sprache

# ApplicationSettingsHeaderUsername.Text
source: Username
de_de: Nutzername

# ApplicationSettingsLanguageDescription.Text
source: You can change your favoured language here.
de_de: Hier können Sie Ihre bevorzugte Sprache wählen.

# ApplicationSettingsListOrderSettingsPivotItem.Header
source: Lists
de_de: Listen

# ApplicationSettingsNotificationSettingsPivotItem.Header
source: Notifications
de_de: Benachrichtigungen

# ApplicationSettingsSaveSettingsButton.Label
source: save
de_de: speichern

# ApplicationSettingsTitle.Text
source: Application settings
de_de: Anwendungseinstellungen

# ApplicationSettingsUserAndLanguageSettings.Header
source: User settings
de_de: Nutzerinformationen

# ApplicationSettingsUsernameTextBox.Header
source: username
de_de: Nutzername

# ApplicationSettingsHeaderNotificationSettings.Text
source: Notifications
de_de: Benachrichtigungen

# ApplicationSettingsNotificationSettingsDescription.Text
source: The behaviour of the application regarding the announcement of incoming messages can be adjusted here. The settings apply generally for the whole application. However, it is possible to set specific notification settings for individual channels or groups which override these settings for the specific resource.
de_de: Hier können Sie das Verhalten der Anwendung bei eingehenden Nachrichten verwalten. Die hier vorgenommenen Einstellungen gelten grundsätzlich für die gesamte Anwendung. Für einzelne Kanäle und Gruppen können auch spezifische Einstellungen vorgenommen werden, welche dann die hier vorgenommenen Einstellungen für die konkrete Ressource überschreiben.

# ApplicationSettingsAnnouncementOrderSettingsDescription.Text
source: It is possible to specify the order of the announcements here. Announcements can be ordered from top to bottom (latest announcement on top) or from bottom to top (latest announcement on bottom).
de_de: Die Anordnung der Benachrichtigungen kann hier eingestellt werden. Die Benachrichtigungen können von oben nach unten (neuste Nachricht ganz oben), oder von unten nach oben (neuste Nachricht ganz unten) angezeigt werden.

# ApplicationSettingsBallotListSettingsDescription.Text
source: This setting defines the order criterion for the enumeration of ballot resources.
de_de: Hier können Sie das Anordnungskriterium für die Auflistung von Abstimmungen festlegen.

# ApplicationSettingsChannelListSettingsDescription.Text
source: This setting defines the order criterion for the enumeration of channel resources.
de_de: Hier können Sie das Anordnungskriterium für die Auflistung von Kanälen festlegen.

# ApplicationSettingsConversationListSettingsDescription.Text
source: This setting defines the order criterion for the enumeration of conversation resources.
de_de: Hier können Sie das Anordnungskriterium für die Auflistung von Konversationen festlegen.

# ApplicationSettingsGeneralListSettingsDescription.Text
source: This setting defines whether entries in enumerations like 'My Channels' should be sorted according to their order criterion in ascending or in descending order.
de_de: Hier können Sie festlegen, ob die Elemente in Auflistungen wie z.B. 'Meine Kanäle' entsprechend ihrem Anordnungskriterium aufsteigend oder absteigend sortiert werden sollen.

# ApplicationSettingsGeneralListSettingsOptionAsc.Content
source: Ascending
de_de: Aufsteigend

# ApplicationSettingsGeneralListSettingsOptionDesc.Content
source: Descending
de_de: Absteigend

# ApplicationSettingsGroupListSettingsDescription.Text
source: This setting defines the order criterion for the enumeration of group resources.
de_de: Hier können Sie das Anordnungskriterium für die Auflistung von Gruppen festlegen.

# ApplicationSettingsHeaderAnnouncementOrderSettings.Text
source: Message order settings
de_de: Anordnung Nachrichten

# ApplicationSettingsHeaderBallotListSettings.Text
source: Ballot order settings
de_de: Abstimmungen

# ApplicationSettingsHeaderChannelListSettings.Text
source: Channel order settings
de_de: Kanäle

# ApplicationSettingsHeaderConversationListSettings.Text
source: Conversation order settings
de_de: Konversationen

# ApplicationSettingsHeaderGeneralListSettings.Text
source: General list settings
de_de: Allgemeine Listeneinstellungen

# ApplicationSettingsHeaderGroupListSettings.Text
source: Group order settings
de_de: Gruppen

# ApplicationErrorErrorServerDatabaseFailure
source: The server could not handle the request successfully. There was a problem with the internal database of the server. Please try again.
de_de: Der Server konnte den Request nicht bearbeiten. Es gab Probleme mit der Server-Datenbank. Bitte versuchen Sie es nochmals.

# ChannelDetailsChannelSettingsButton.Label
source: settings
de_de: einstel-lungen

# ChannelSettingsHeadline.Text
source: Channel settings
de_de: Kanaleinstellungen

# ChannelSettingsNotificationSettingsDescription.Text
source: The settings defined here override the global notification settings for this specific channel. If the default option is chosen, the globally defined notification settings will be applied for this channel.
de_de: Hier können Sie für diesen Kanal spezifische Benachrichtigungseinstellungen festlegen, welche die globalen Einstellungen überschreiben. Wenn Sie Default wählen, werden für den Kanal die globalen Benachrichtigungseinstellungen verwendet.

# ChannelSettingsNotificationSettingsHeader.Text
source: Notifications
de_de: Benachrichtigungen

# ChannelSettingsSaveButton.Label
source: save
de_de: speichern

# LoginPageDescription.Text
source: Please enter your login credentials in order to access the moderator view of the application. If you have no account, have forgotten your password or have any other problem, please visit:
de_de: Um zur Moderatorenansicht der Anwendung zu gelangen, geben Sie hier bitte Ihre Login Daten an. Wenn Sie keinen Moderatorenaccount haben, Ihr Passwort vergessen haben, oder andere Probleme auftreten, besuchen Sie bitte:

# LoginPageLoginButton.Label
source: login
de_de: anmelden

# LoginPageLoginFailureCaseGone
source: The account for the specified credentials has been deleted.
de_de: Der Account zu den angegebenen Daten existiert nicht mehr.

# LoginPageLoginFailureCaseLocked
source: Your account is locked. The account needs to be unlocked by an administrator.
de_de: Ihr Account ist gesperrt und wurde noch nicht freigegeben. Der Account muss zunächst von einem Administrator freigeschalten werden.

# LoginPageLoginFailureCaseNotFound
source: There is no account with the provided username.
de_de: Es wurde kein Account mit diesem Nutzernamen gefunden.

# LoginPageLoginFailureCasePasswordNull
source: No password is provided.
de_de: Es wurde kein Passwort angegeben.

# LoginPageLoginFailureCaseUnauthorized
source: The credentials are not valid. Username or password is not correct.
de_de: Die von Ihnen eingegebenen Login Daten sind nicht korrekt. Bitte prüfen Sie ob Nutzername und Passwort richtig eingegeben wurden.

# LoginPageLoginFailureCaseUsernameNull
source: No username is provided.
de_de: Es wurde kein Nutzername angegeben.

# LoginPagePasswordTextBox.Header
source: Password
de_de: Passwort

# LoginPageTitle.Text
source: Moderator login
de_de: Moderatoren-Login

# LoginPageUsernameTextBox.Header
source: Username
de_de: Nutzername

# HomescreenNoChannelSubscribedInfoText.Text
source: There is no subscribed channel. The button at the bottom of the page takes you to the channel search where channels can be subscribed.
de_de: Es wurde noch kein Kanal abonniert. Gehen Sie auf die Kanalsuche, um einen Kanal zu abonnieren.

# HomescreenModeratorMyChannelsPivotItem.Header
source: Managed channels
de_de: Verwaltete Kanäle

# ModeratorChannelDetailsAnnouncementPivotItem.Header
source: Messages
de_de: Benachrichtigungen

# ModeratorChannelDetailsChannelInfoPivotItem.Header
source: Channel information
de_de: Kanalinformationen

# AddAnnouncementDialogContentTextBox.Header
source: Content
de_de: Nachricht

# AddAnnouncementDialogDescription.Text
source: Please fill in the information into the displayed fields. Click the 'send' button in order to distribute the announcement to the subscribers. All fields are mandatory.
de_de: Füllen Sie die unten aufgeführten Felder aus und klicken Sie anschließend auf 'senden', um die Benachrichtigung an die Abonnenten des Kanals zu senden. Alle Felder sind Pflichtfelder.

# AddAnnouncementDialogPriorityComboBox.Header
source: Priority
de_de: Priorität

# AddAnnouncementDialogPriorityComboBoxItemPrioHigh.Content
source: High
de_de: Hoch

# AddAnnouncementDialogSendMessageButton.Label
source: send
de_de: senden

# AddAnnouncementDialogTitle.Text
source: Add announcement
de_de: Benachrichtigung hinzufügen

# AddAnnouncementDialogTitleTextBox.Header
source: Title
de_de: Titel

# AddAnnouncementValidationErrorTextIsNull
source: Please add a text as the message content.
de_de: Bitte setzen Sie einen Text.

# AddAnnouncementValidationErrorTextTooLong
source: The text of the message is too long. The content of the message should not exceed a length of 500 characters.
de_de: Der Text der Nachricht ist zu lang. Die maximale Länge beträgt 500 Zeichen.

# AddAnnouncementValidationErrorTitleIsNull
source: Please add a title.
de_de: Bitte setzen Sie einen Titel.

# AddAnnouncementValidationErrorTitleTooLong
source: The title of the message is too long. The title should not exceed a length of 45 characters.
de_de: Der Titel der Nachricht ist zu lang. Die maximale Länge beträgt 45 Zeichen.

# FlyoutWariningDialogCloseButton.Content
source: Leave dialog
de_de: Dialog verlassen

# FlyoutWarningDialogCloseDescription.Text
source: Warning! If you leave this dialog the entered data will be discarded.
de_de: Achtung! Wenn Sie den Dialog verlassen werden die von Ihnen eingetragenen Daten verworfen.

# AddAndEditChannelAddChannelButton.Label
source: create channel
de_de: kanal anlegen

# AddAndEditChannelAddChannelTitle.Text
source: Add channel
de_de: Kanal anlegen

# AddAndEditChannelAssistantInfoTooLongValidationError
source: The assistant information must not exceed 120 characters.
de_de: Die Informationen zum Übungsleiter dürfen nicht mehr als 120 Zeichen umfassen.

# AddAndEditChannelAssistantTextBox.Header
source: Assistants
de_de: Übungsleiter/Assistenten

# AddAndEditChannelContactsInfoTooLongValidationError
source: The contacts information must not exceed 120 characters.
de_de: Die Kontaktinformationen dürfen nicht mehr als 120 Zeichen umfassen.

# AddAndEditChannelContactsIsNullValidationError
source: Please enter contact information.
de_de: Bitte geben Sie Kontaktinformationen an.

# AddAndEditChannelContactsTextBox.Header
source: Contacts *
de_de: Kontakt *

# AddAndEditChannelDatesInfoTooLongValidationError
source: The dates info must not exceed the size of 150 characters.
de_de: Die Angaben zu den Terminen dürfen nicht mehr als 150 Zeichen umfassen.

# AddAndEditChannelDatesTextBox.Header
source: Dates
de_de: Termine

# AddAndEditChannelDescriptionAddChannel.Text
source: Enter the data for the new channel. There is the possibility to switch between different channel types. Depending on the selected type, the template will be adjusted and provides relevant data fields for this kind of channel. The fields with a * mark are mandatory fields.
de_de: Geben Sie die Daten des neuen Kanals an. Sie können zwischen verschiedenen Kanaltypen wählen. Abhängig vom Kanaltyp wird die Vorlage angepasst und Sie erhalten für den Typ relevante Datenfelder. Die mit einem * gekennzeichneten Felder sind Pflichtfelder.

# AddAndEditChannelDescriptionEditChannel.Text
source: The information of the selected channel can be altered here. The fields with a * mark are mandatory fields.
de_de: Hier können Sie Änderungen an den Kanalinformationen ausführen. Die mit einem * gekennzeichneten Felder sind Pflichtfelder.

# AddAndEditChannelDescriptionTextBlock.Header
source: Description
de_de: Beschreibung

# AddAndEditChannelDescriptionTooLongValidationError
source: The channel description must not exceed 500 characters.
de_de: Die Kanalbeschreibung darf die Länge von 500 Zeichen nicht überschreiten.

# AddAndEditChannelEditChannelButton.Label
source: save
de_de: speichern

# AddAndEditChannelEditChannelTitle.Text
source: Edit channel
de_de: Kanal bearbeiten

# AddAndEditChannelEndDateInfoTooLongValidationError
source: The information about the end date must not exceed 45 characters.
de_de: Die Informationen zum Vorlesungsende dürfen nicht mehr als 45 Zeichen umfassen.

# AddAndEditChannelEndDateTextBox.Header
source: End date of lecture
de_de: Datum Vorlesungsende

# AddAndEditChannelEventCostInfoTooLongValidationError
source: The information about the cost must not exceed 150 characters.
de_de: Die Informationen zu den Eintrittskosten dürfen nicht mehr als 150 Zeichen umfassen.

# AddAndEditChannelEventCostTextBox.Header
source: Cost
de_de: Eintrittskosten

# AddAndEditChannelEventOrganizerInfoTooLongValidationError
source: The information about the organizer must not exceed 120 characters.
de_de: Die Informationen über den Veranstalter der Veranstaltung dürfen nicht mehr als 120 Zeichen umfassen.

# AddAndEditChannelEventOrganizerTextBox.Header
source: Organizer
de_de: Veranstalter

# AddAndEditChannelLectureFacultyComboBox.Header
source: Faculty *
de_de: Fakultät *

# AddAndEditChannelLectureFacultyEngineering.Content
source: Faculty of Engineering, Computer Science and Pschology
de_de: Fakultät für Ingenieurwissenschaften, Informatik und Psychologie

# AddAndEditChannelLectureFacultyMathematics.Content
source: Faculty of Mathematics and Economics
de_de: Fakultät für Mathematik und Wirtschaftswissenschaften

# AddAndEditChannelLectureFacultyMedicines.Content
source: Faculty of Medicine
de_de: Medizinische Fakultät

# AddAndEditChannelLectureFacultyNaturalScienceItem.Content
source: Faculty of Natural Sciences
de_de: Fakultät für Naturwissenschaften

# AddAndEditChannelLecturerIsNullValidationError
source: Please enter a lecturer.
de_de: Bitte geben Sie einen Dozent an.

# AddAndEditChannelLecturerTextBox.Header
source: Lecturer *
de_de: Dozent *

# AddAndEditChannelLecturerTooLongValidatonError
source: The lecturer information must not exceed 120 characters.
de_de: Die Informationen zum Dozenten dürfen nicht mehr als 120 Zeichen umfassen.

# AddAndEditChannelLocationsInfoTooLongValidationError
source: The locations info must not exceed the size of 120 characters.
de_de: Die Angaben zum Ort dürfen nicht mehr als 120 Zeichen umfassen.

# AddAndEditChannelLocationsTextBox.Header
source: Locations
de_de: Ort

# AddAndEditChannelNameIsNullValidationError
source: Please enter a channel name.
de_de: Bitte geben Sie einen Kanalnamen ein.

# AddAndEditChannelNameTooLongValidationError
source: The channel name must not exceed 45 characters and should contain at least 3 characters.
de_de: Der Kanalname darf die Länge von 45 Zeichen nicht überschreiten und sollte mindestens 3 Zeichen umfassen.

# AddAndEditChannelSportsAmountOfParticipantsTextBox.Header
source: Amount of participants
de_de: Anzahl Teilnehmer
